a = int(input("Введите первое число:"))
b = int(input('Введите второе число:'))
if a > b:
    print("первое число максимальное, а второе минимальное")
    else:
        print("второе число максимальное, а первое минимальное")
#2
a = int(input("ВВедите сторону квадрата:"))
b = int(input("Введите радиус"))
if a > b:
    print("влезет")
    else:
        print("не влезет")
 
#3
a = int(input("Введите радиус:"))
b = int(input("Введите сторону квадрата"))
if a > b:
    print("квадрат поместится")
    else:
        print("квадрат не поместится")
#4
a = int(input("Введите первое число:"))
b = int(input("Введите второе число:"))
if a > b:
    print("первое число - большее")
    else:
        print("второе число - большее")
#5
a = int(input("Введите первое число:"))
b = int(input("Введите второе число:"))
if a < b:
    print("первое число - меньшее")
    else:
        print("второе число -меньшее")


3,6
a = int(input('Введите x: '))
if a < 0:
print("y =", a**2)
if a > 0:
    print("y =", 1/(a**2))